testsuite/phaseChange/suckingInterface/system/fluid/setFieldfromTableDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

field T.water;

file "T01.csv";
readerType csv;
hasHeaderLine false;
timeColumn 0;
valueColumns (1);

function plane;
origin (0 0 0);
normal (1 0 0);











// ************************************************************************* //
